{
  "nav.home": "Startseite",
  "nav.blog": "Blog",
  "nav.about": "Über",
  "nav.projects": "Projekte",
  "nav.login": "Anmelden",
  "nav.experience": "Erfahrung",
  "about.title": "Über mich",
  "about.description": "Erfahren Sie mehr über mich und meinen Werdegang",
  "about.imageAlt": "Foto von mir mit einem roten Buch",
  "about.paragraph1": "Ich entwickle Systeme, die von Präzision und Prinzipien geleitet werden. Code ist ein Vehikel für Klarheit, in dem Logik, Strenge und Überzeugung zusammenlaufen.",
  "about.paragraph2": "Als Autodidakt habe ich jahrelang komplexe Probleme in verschiedenen Disziplinen bewältigt. Ich habe zu einflussreichen Open-Source-Projekten beigetragen, Smart Contracts mit mathematischen Garantien entwickelt und dezentrale Systeme aus ersten Prinzipien heraus konzipiert. Funktionale Programmierung, formale Verifikation und Blockchain-Architektur sind für mich keine Abstraktionen – sie sind die Werkzeuge, mit denen ich Absicht in Ausführung übersetze.",
  "about.paragraph3": "Mein Ansatz wurzelt in präsuppositionaler Erkenntnistheorie, österreichischer Praxeologie und reformierter Theologie. Das ist keine Philosophie um der Philosophie willen. Diese Fundamente schärfen mein Denken und prägen meine Arbeit unmittelbar. Klarheit in einem Bereich stärkt die Präzision im anderen. Ein gut konstruierter Smart Contract und ein kohärentes theologisches System verlangen dieselbe intellektuelle Redlichkeit: keine geliehenen Annahmen, keine versteckten Widersprüche.",
  "about.paragraph4": "Jede Designentscheidung spiegelt eine Philosophie wider. Dezentralisierung zu priorisieren heißt Souveränität zu bewahren. Starke Typsysteme einzusetzen heißt Mehrdeutigkeit zu eliminieren. Formale Verifikation anzustreben heißt die Vorstellung abzulehnen, dass \"annähernd richtig\" genügt, wenn Sicherheit von Bedeutung ist. Das sind keine Einschränkungen – das ist eine Rückkehr zur Klarheit.",
  "about.paragraph5": "Mich treibt eine einzige Überzeugung an: Systeme zu bauen, die Bestand haben. Systeme, die Prinzipien folgen, nicht Anreizstrukturen oder Zwang. Systeme, die meine Kinder ohne Rechtfertigungen erben können. Das bedeutet, Tiefe statt Bequemlichkeit zu wählen, Signal statt Rauschen und eigene Werkzeuge statt Unternehmensabhängigkeit.",
  "about.paragraph6": "Meine Arbeit umfasst DeFi-Infrastruktur, funktionale Programmierung und Open-Source-Entwicklung. Ich schreibe über Blockchain, Philosophie, Wirtschaft und Theologie und erforsche, wie Technologie dienen kann, statt einzuschränken.",
  "blog.title": "Blog",
  "blog.description": "Beiträge über Entwicklung, formale Beweise und andere interessante Themen",
  "blog.readMore": "Mehr lesen",
  "blog.backToBlog": "Zurück zum Blog",
  "blog.postsTitle": "Blog-Beiträge",
  "blog.noPosts": "Keine Beiträge gefunden.",
  "blog.notFound": "Beitrag nicht gefunden",
  "blog.notFoundDescription": "Der angeforderte Blog-Beitrag konnte nicht gefunden werden.",
  "projects.title": "Projekte",
  "projects.description": "Einige meiner persönlichen Projekte und Beiträge",
  "projects.phi.title": "Phi - Ein reiner Lambda-Kalkül-Interpreter",
  "projects.phi.description": "Phi ist ein ausgeklügelter Interpreter für reinen Lambda-Kalkül, implementiert in Haskell. Er bietet eine elegante und leistungsstarke Umgebung zur Erkundung von Lambda-Kalkül-Ausdrücken und eignet sich ideal für Bildungszwecke und theoretische Informatikforschung.",
  "projects.treeson.title": "Treeson",
  "projects.treeson.description": "Treeson ist ein Kommandozeilenwerkzeug, das Verzeichnisstrukturen und GitHub-Repositories in JSON-Format konvertiert. Perfekt für Dokumentation, Analyse und Werkzeugzwecke.",
  "projects.flowcash.title": "FlowCash",
  "projects.flowcash.description": "Eine moderne und elegante App zur Verwaltung persönlicher Finanzen, erstellt mit React Native und Expo. Mit einer Premium-UI im Glassmorphism-Stil und vollständig offline Architektur konzipiert, befähigt sie Benutzer, ihre täglichen Finanzen sicher und intuitiv zu verfolgen, zu analysieren und zu verwalten.",
  "projects.kind.title": "Software-Grundlagen in Kind (pt-BR)",
  "projects.kind.description": "Eine Übersetzung des Buches \"Software Foundations in Idris\" ins Portugiesische, unter Verwendung der Programmiersprache Kind. Dieses Projekt wurde in Zusammenarbeit mit Savio für die Higher Order Company entwickelt.",
  "projects.agdavim.title": "Agda-vim",
  "projects.agdavim.description": "Ein umfassendes Vim-Plugin, das vollständige Syntaxhervorhebung für Agda-Dateien hinzufügt, einschließlich Schlüsselwörtern, Typen, Operatoren, Unicode-Symbolen und praktischen Tastaturkürzeln für mathematische Notation (λ, →, ∀, ≡).",
  "projects.agoriz.title": "Agoriz",
  "projects.agoriz.description": "Agoriz ist ein Projekt, das darauf abzielt, Web3-Zahlungen für Unternehmen zu ermöglichen. Es wurde entwickelt, um Blockchain-basierte Transaktionen zu vereinfachen, zu skalieren und zu sichern, sodass Unternehmen digitale Assets und programmierbare Finanzen in ihre täglichen Abläufe integrieren können.",
  "experience.title": "Erfahrung",
  "experience.description": "Meine berufliche Laufbahn in Softwareentwicklung, Blockchain und dezentralen Systemen",
  "experience.skills.title": "Fähigkeiten",
  "experience.skills.description": "Technischer Stack und Fachgebiete, die im Laufe meiner Karriere entwickelt wurden",
  "experience.education.title": "Bildung",
  "experience.education.description": "Lernreise und berufliche Entwicklung",
  "experience.education.autodidact": "Autodidaktischer Software-Ingenieur",
  "experience.education.subtitle": "Kontinuierliches Lernen und technische Gemeinschaften",
  "experience.education.details": "Kein formaler akademischer Abschluss, aber rigoroses Lernen durch Fachartikel, praktische Projekte und Open-Source-Beiträge. Philosophie, Logik und reformierte Theologie begründen technische Entscheidungen und Designstrategien.",
  "footer.rights": "Alle Rechte vorbehalten",
  "footer.madeWith": "Hergestellt mit",
  "common.loading": "Wird geladen...",
  "common.error": "Fehler beim Laden",
  "common.notFound": "Nicht gefunden",
  "theme.light": "Helles Thema",
  "theme.dark": "Dunkles Thema",
  "theme.toggle": "Thema wechseln",
  "experience.agoriz.title": "Gründer & Entwickler",
  "experience.agoriz.period": "Jun 2025 - Gegenwart",
  "experience.agoriz.location": "Remote",
  "experience.agoriz.description": "Habe Agoriz erstellt und leite es, ein dezentrales Zahlungsprotokoll—\"Stripe für Blockchain\". Entwickle und optimiere Smart Contracts mit strenger Sicherheit, Multi-Chain-Architektur und Zero-Custody. Verantwortlich für Design, Tests, Deployment und Feature-Planung, um Skalierbarkeit und vollständige Privatsphäre zu gewährleisten.",
  "experience.hoc.title": "Software-Entwickler",
  "experience.hoc.period": "Mär 2023 - Feb 2025",
  "experience.hoc.location": "São Paulo, Brasilien (Hybrid)",
  "experience.hoc.description": "Zwei Jahre Entwicklung skalierbarer Web-Lösungen mit Fokus auf Qualität und Performance. Beitrug zu prominenten Open-Source-Projekten (Bend 19k⭐, Kind 3.7k⭐). Erstellte responsive Interfaces, robuste APIs und sichere Authentifizierungssysteme, wobei immer Best Practices und automatisierte Tests angewendet wurden.",
  "experience.uwu.title": "Spieleentwickler",
  "experience.uwu.period": "Okt 2023 - Sep 2024",
  "experience.uwu.location": "Remote (Teilzeit)",
  "experience.uwu.description": "Entwickelte komplexe Spielmechaniken, KI-Systeme, Physiksimulationen und immersive Erlebnisse. Erstellte Shader und visuelle Effekte mit Optimierung für mehrere Plattformen. Arbeitete mit Künstlern und Designern für Asset-Integration und visuelle Qualität zusammen.",
  "experience.kindelia.title": "Lehrling für Funktionale Programmierung",
  "experience.kindelia.period": "Apr 2022 - Apr 2023",
  "experience.kindelia.location": "Remote",
  "experience.kindelia.description": "Studierte und wendete funktionale Programmierung mit Haskell, Agda, Kind und HVM an. Forschte zu Web3 und Smart Contracts, wendete formale Methoden an, um Software-Korrektheit und präzise mathematische Abstraktionen zu gewährleisten.",
  "skills.functional.label": "Funktionale & Formale Sprachen",
  "skills.blockchain.label": "Blockchain & Web3",
  "skills.web.label": "Web & Mobile",
  "skills.game.label": "Spieleentwicklung",
  "skills.tools.label": "Werkzeuge & Praktiken",
  "skills.domains.label": "Bereiche",
  "konamiDoom.title": "DOOM (1993)",
  "konamiDoom.loading": "DOOM wird geladen...",
  "konamiDoom.activated": "Konami-Code aktiviert!",
  "konamiDoom.preparing": "Bereite DOOM vor...",
  "konamiDoom.controls": "Steuerung: Klicke auf das Spiel und benutze die Pfeiltasten zum Bewegen, Strg zum Schießen, Alt für seitliche Bewegungen, Leertaste zum Benutzen.",
  "konamiDoom.performanceTip": "Performance-Tipp: Wenn das Spiel langsam läuft, versuche auf niedrige Qualität umzuschalten.",
  "konamiDoom.quality.low": "Niedrig",
  "konamiDoom.quality.medium": "Mittel",
  "konamiDoom.quality.high": "Hoch",
  "konamiDoom.close": "Spiel schließen",
  "yuu.question": "Bist du Yuu?",
  "yuu.yes": "JA",
  "yuu.no": "NEIN"
}
