{
  "nav.home": "Home",
  "nav.blog": "Blog",
  "nav.about": "About",
  "nav.projects": "Projects",
  "nav.login": "Login",
  "nav.experience": "Experience",
  "about.title": "About",
  "about.description": "Learn more about me and my journey",
  "about.imageAlt": "Picture of me with a red book",
  "about.paragraph1": "I build systems guided by precision and principle. Code is a vehicle for clarity, where logic, rigor, and conviction converge.",
  "about.paragraph2": "As a self-taught engineer, I've spent years tackling complex problems across multiple disciplines. I've contributed to high-impact open-source projects, developed smart contracts with mathematical guarantees, and designed decentralized systems from first principles. Functional programming, formal verification, and blockchain architecture aren't abstractions. They're how I translate intention into execution.",
  "about.paragraph3": "My approach is grounded in presuppositional epistemology, Austrian praxeology, and reformed theology. This isn't philosophy for the sake of philosophy. These foundations sharpen my reasoning and directly shape my work. Clarity in one area strengthens precision in another. A well-built smart contract and a coherent theological system demand the same intellectual honesty: no borrowed assumptions, no hidden contradictions.",
  "about.paragraph4": "Every design decision reflects a philosophy. Prioritizing decentralization is preserving sovereignty. Using strong type systems is eliminating ambiguity. Pursuing formal verification is rejecting the notion that \"approximately correct\" is sufficient when security matters. These aren't constraints—they're a return to clarity.",
  "about.paragraph5": "I'm driven by a single conviction: building systems that endure. Systems that answer to principles, not to incentive structures or coercion. Systems my children can inherit without justifications. That means choosing depth over convenience, signal over noise, and owning my own tools over corporate dependency.",
  "about.paragraph6": "My work spans DeFi infrastructure, functional programming, and open-source development. I write about blockchain, philosophy, economics, and theology—exploring how technology can serve rather than constrain.",
  "blog.title": "Blog",
  "blog.description": "Posts about development, formal proofs, and other interesting topics",
  "blog.readMore": "Read more",
  "blog.backToBlog": "Back to Blog",
  "blog.postsTitle": "Blog Posts",
  "blog.noPosts": "No posts found.",
  "blog.notFound": "Post not found",
  "blog.notFoundDescription": "The requested blog post could not be found.",
  "projects.title": "Projects",
  "projects.description": "Some of my personal projects and contributions",
  "projects.phi.title": "Phi - A Pure Lambda Calculus Interpreter",
  "projects.phi.description": "Phi is a sophisticated interpreter for pure lambda calculus, implemented in Haskell. It provides an elegant and powerful environment for exploring lambda calculus expressions, making it ideal for educational purposes and theoretical computer science research.",
  "projects.treeson.title": "Treeson",
  "projects.treeson.description": "Treeson is a command-line tool that converts directory structures and GitHub repositories into JSON format. Perfect for documentation, analysis, and tooling purposes.",
  "projects.flowcash.title": "FlowCash",
  "projects.flowcash.description": "A modern and elegant personal finance management app built with React Native and Expo. Designed with a premium glassmorphism-inspired UI and fully offline architecture, it empowers users to track, analyze, and manage their daily finances securely and intuitively.",
  "projects.kind.title": "Software Foundations in Kind (pt-BR)",
  "projects.kind.description": "A translation of the book \"Software Foundations in Idris\" into Portuguese, using the Kind programming language. This project was developed in collaboration with Savio for the Higher Order Company.",
  "projects.agdavim.title": "Agda-vim",
  "projects.agdavim.description": "A comprehensive Vim plugin that adds full syntax highlighting support for Agda files, including keywords, types, operators, Unicode symbols, and convenient keyboard shortcuts for mathematical notation (λ, →, ∀, ≡).",
  "projects.agoriz.title": "Agoriz",
  "projects.agoriz.description": "Agoriz is a project aimed at bringing Web3 payments to enterprises. It is designed to simplify, scale, and secure blockchain-based transactions, enabling businesses to integrate digital assets and programmable finance into their daily operations.",
  "experience.title": "Experience",
  "experience.description": "My professional journey in software development, blockchain, and decentralized systems",
  "experience.skills.title": "Skills",
  "experience.skills.description": "Technical stack and expertise domains developed throughout my career",
  "experience.education.title": "Education",
  "experience.education.description": "Learning journey and professional development",
  "experience.education.autodidact": "Self-Taught Software Engineer",
  "experience.education.subtitle": "Continuous Learning & Technical Communities",
  "experience.education.details": "No formal academic degree, but rigorous learning through papers, practical projects, and open-source contributions. Philosophy, logic, and reformed theology ground technical decisions and design strategies.",
  "footer.rights": "All rights reserved",
  "footer.madeWith": "Made with",
  "common.loading": "Loading...",
  "common.error": "Error loading",
  "common.notFound": "Not found",
  "theme.light": "Light Theme",
  "theme.dark": "Dark Theme",
  "theme.toggle": "Toggle theme",
  "experience.agoriz.title": "Founder & Developer",
  "experience.agoriz.period": "Jun 2025 - Present",
  "experience.agoriz.location": "Remote",
  "experience.agoriz.description": "Created and lead Agoriz, a decentralized payment protocol—\"Stripe for blockchain\". Develop and optimize smart contracts with strict security, multi-chain architecture, and zero-custody. Responsible for design, testing, deployment, and feature planning, ensuring scalability and full privacy.",
  "experience.hoc.title": "Software Developer",
  "experience.hoc.period": "Mar 2023 - Feb 2025",
  "experience.hoc.location": "São Paulo, Brazil (Hybrid)",
  "experience.hoc.description": "Two years developing scalable web solutions focused on quality and performance. Contributed to prominent open-source projects (Bend 19k⭐, Kind 3.7k⭐). Built responsive interfaces, robust APIs, and secure authentication systems, always applying best practices and automated testing.",
  "experience.uwu.title": "Game Developer",
  "experience.uwu.period": "Oct 2023 - Sep 2024",
  "experience.uwu.location": "Remote (Part-time)",
  "experience.uwu.description": "Developed complex game mechanics, AI systems, physics simulations, and immersive experiences. Created shaders and visual effects, optimizing for multiple platforms. Collaborated with artists and designers for asset integration and visual quality.",
  "experience.kindelia.title": "Functional Programming Apprentice",
  "experience.kindelia.period": "Apr 2022 - Apr 2023",
  "experience.kindelia.location": "Remote",
  "experience.kindelia.description": "Studied and applied functional programming with Haskell, Agda, Kind, and HVM. Researched Web3 and smart contracts, applying formal methods to ensure software correctness and precise mathematical abstractions.",
  "skills.functional.label": "Functional & Formal Languages",
  "skills.blockchain.label": "Blockchain & Web3",
  "skills.web.label": "Web & Mobile",
  "skills.game.label": "Game Development",
  "skills.tools.label": "Tools & Practices",
  "skills.domains.label": "Domains",
  "konamiDoom.title": "DOOM (1993)",
  "konamiDoom.loading": "Loading DOOM...",
  "konamiDoom.activated": "Konami Code Activated!",
  "konamiDoom.preparing": "Preparing to run DOOM...",
  "konamiDoom.controls": "Controls: Click on the game and use arrow keys to move, Ctrl to shoot, Alt for strafing, Space to use.",
  "konamiDoom.performanceTip": "Performance tip: If the game is running slow, try switching to Low quality.",
  "konamiDoom.quality.low": "Low",
  "konamiDoom.quality.medium": "Medium",
  "konamiDoom.quality.high": "High",
  "konamiDoom.close": "Close game"
}
