{
  "nav.home": "Inicio",
  "nav.blog": "Blog",
  "nav.about": "Acerca de",
  "nav.projects": "Proyectos",
  "nav.login": "Iniciar sesión",
  "nav.experience": "Experiencia",
  "about.title": "Sobre mí",
  "about.description": "Conoce más sobre mí y mi trayectoria",
  "about.imageAlt": "Foto mía con un libro rojo",
  "about.paragraph1": "Construyo sistemas guiados por precisión y principio. El código es un vehículo para la claridad, donde lógica, rigor y convicción convergen.",
  "about.paragraph2": "Como ingeniero autodidacta, he pasado años enfrentando problemas complejos en múltiples disciplinas. He contribuido a proyectos open-source de alto impacto, desarrollado smart contracts con garantías matemáticas y diseñado sistemas descentralizados a partir de primeros principios. Programación funcional, verificación formal y arquitectura blockchain no son abstracciones. Son la forma en que traduzco intención en ejecución.",
  "about.paragraph3": "Mi enfoque se fundamenta en epistemología pressuposicional, praxeología austríaca y teología reformada. Esto no es filosofía por amor a la filosofía. Estos fundamentos agudizan mi razonamiento y moldean directamente mi trabajo. Claridad en un área fortalece precisión en otra. Un smart contract bien construido y un sistema teológico coherente exigen la misma honestidad intelectual: ninguna suposición prestada, ninguna contradicción oculta.",
  "about.paragraph4": "Cada decisión de diseño refleja una filosofía. Priorizar la descentralización es preservar soberanía. Usar sistemas de tipos fuertes es eliminar ambigüedad. Buscar verificación formal es rechazar la idea de que \"aproximadamente correcto\" es suficiente cuando la seguridad importa. Estas no son restricciones, son un retorno a la claridad.",
  "about.paragraph5": "Me mueve una única convicción: construir sistemas que perduren. Sistemas que respondan a principios, no a estructuras de incentivo o coerción. Sistemas que mis hijos puedan heredar sin justificaciones. Eso significa elegir profundidad en lugar de conveniencia, señal en lugar de ruido y herramientas propias en lugar de dependencia corporativa.",
  "about.paragraph6": "Mi trabajo abarca infraestructura DeFi, programación funcional y desarrollo open-source. Escribo sobre blockchain, filosofía, economía y teología, explorando cómo la tecnología puede servir en lugar de restringir.",
  "blog.title": "Blog",
  "blog.description": "Publicaciones sobre desarrollo, pruebas formales y otros temas interesantes",
  "blog.readMore": "Leer más",
  "blog.backToBlog": "Volver al Blog",
  "blog.postsTitle": "Publicaciones del Blog",
  "blog.noPosts": "No se encontraron publicaciones.",
  "blog.notFound": "Publicación no encontrada",
  "blog.notFoundDescription": "No se pudo encontrar la publicación solicitada.",
  "projects.title": "Proyectos",
  "projects.description": "Algunos de mis proyectos personales y contribuciones",
  "projects.phi.title": "Phi - Un Intérprete de Cálculo Lambda Puro",
  "projects.phi.description": "Phi es un intérprete sofisticado para el cálculo lambda puro, implementado en Haskell. Proporciona un entorno elegante y poderoso para explorar expresiones de cálculo lambda, lo que lo hace ideal para fines educativos e investigación en ciencias de la computación teórica.",
  "projects.treeson.title": "Treeson",
  "projects.treeson.description": "Treeson es una herramienta de línea de comandos que convierte estructuras de directorios y repositorios de GitHub en formato JSON. Perfecta para documentación, análisis y herramientas.",
  "projects.flowcash.title": "FlowCash",
  "projects.flowcash.description": "Una aplicación moderna y elegante de gestión de finanzas personales construida con React Native y Expo. Diseñada con una interfaz premium inspirada en glassmorphism y arquitectura totalmente offline, capacita a los usuarios para rastrear, analizar y gestionar sus finanzas diarias de forma segura e intuitiva.",
  "projects.kind.title": "Fundamentos de Software en Kind (pt-BR)",
  "projects.kind.description": "Una traducción del libro \"Software Foundations in Idris\" al portugués, utilizando el lenguaje de programación Kind. Este proyecto fue desarrollado en colaboración con Savio para la Higher Order Company.",
  "projects.agdavim.title": "Agda-vim",
  "projects.agdavim.description": "Un plugin completo de Vim que agrega soporte completo de resaltado de sintaxis para archivos Agda, incluyendo palabras clave, tipos, operadores, símbolos Unicode y atajos de teclado convenientes para notación matemática (λ, →, ∀, ≡).",
  "projects.agoriz.title": "Agoriz",
  "projects.agoriz.description": "Agoriz es un proyecto destinado a llevar pagos Web3 a las empresas. Está diseñado para simplificar, escalar y asegurar transacciones basadas en blockchain, permitiendo que las empresas integren activos digitales y finanzas programables en sus operaciones diarias.",
  "experience.title": "Experiencia",
  "experience.description": "Mi trayectoria profesional en desarrollo de software, blockchain y sistemas descentralizados",
  "experience.skills.title": "Habilidades",
  "experience.skills.description": "Stack técnico y dominios de experiencia desarrollados a lo largo de mi carrera",
  "experience.education.title": "Formación",
  "experience.education.description": "Trayectoria de aprendizaje y desarrollo profesional",
  "experience.education.autodidact": "Ingeniero de Software Autodidacta",
  "experience.education.subtitle": "Aprendizaje Continuo y Comunidades Técnicas",
  "experience.education.details": "Sin título académico formal, pero con aprendizaje riguroso a través de artículos, proyectos prácticos y contribuciones de código abierto. La filosofía, la lógica y la teología reformada fundamentan las decisiones técnicas y las estrategias de diseño.",
  "footer.rights": "Todos los derechos reservados",
  "footer.madeWith": "Hecho con",
  "common.loading": "Cargando...",
  "common.error": "Error al cargar",
  "common.notFound": "No encontrado",
  "theme.light": "Tema Claro",
  "theme.dark": "Tema Oscuro",
  "theme.toggle": "Cambiar tema",
  "experience.agoriz.title": "Fundador y Desarrollador",
  "experience.agoriz.period": "Jun 2025 - Presente",
  "experience.agoriz.location": "Remoto",
  "experience.agoriz.description": "Creé y lidero Agoriz, protocolo de pagos descentralizado—\"Stripe para blockchain\". Desarrollo y optimizo smart contracts con seguridad rigurosa, arquitectura multi-chain y cero custodia. Responsable del diseño, pruebas, despliegue y planificación de funcionalidades, garantizando escalabilidad y privacidad total.",
  "experience.hoc.title": "Desarrollador de Software",
  "experience.hoc.period": "Mar 2023 - Feb 2025",
  "experience.hoc.location": "São Paulo, Brasil (Híbrido)",
  "experience.hoc.description": "Dos años desarrollando soluciones web escalables con enfoque en calidad y rendimiento. Contribuí a proyectos open-source destacados (Bend 19k⭐, Kind 3.7k⭐). Creé interfaces responsivas, APIs robustas y sistemas de autenticación seguros, siempre aplicando mejores prácticas y pruebas automatizadas.",
  "experience.uwu.title": "Desarrollador de Videojuegos",
  "experience.uwu.period": "Oct 2023 - Sep 2024",
  "experience.uwu.location": "Remoto (Medio tiempo)",
  "experience.uwu.description": "Desarrollé mecánicas de juego complejas, sistemas de IA, simulaciones físicas y experiencias inmersivas. Creé shaders y efectos visuales, optimizando para múltiples plataformas. Colaboré con artistas y diseñadores para integración de activos y calidad visual.",
  "experience.kindelia.title": "Aprendiz de Programación Funcional",
  "experience.kindelia.period": "Abr 2022 - Abr 2023",
  "experience.kindelia.location": "Remoto",
  "experience.kindelia.description": "Estudié y apliqué programación funcional con Haskell, Agda, Kind y HVM. Investigué Web3 y smart contracts, aplicando métodos formales para garantizar corrección de software y abstracciones matemáticas precisas.",
  "skills.functional.label": "Lenguajes Funcionales y Formales",
  "skills.blockchain.label": "Blockchain y Web3",
  "skills.web.label": "Web y Móvil",
  "skills.game.label": "Desarrollo de Videojuegos",
  "skills.tools.label": "Herramientas y Prácticas",
  "skills.domains.label": "Dominios",
  "konamiDoom.title": "DOOM (1993)",
  "konamiDoom.loading": "Cargando DOOM...",
  "konamiDoom.activated": "¡Código Konami Activado!",
  "konamiDoom.preparing": "Preparando para ejecutar DOOM...",
  "konamiDoom.controls": "Controles: Haz clic en el juego y usa las flechas para moverte, Ctrl para disparar, Alt para movimiento lateral, Espacio para usar.",
  "konamiDoom.performanceTip": "Consejo de rendimiento: Si el juego va lento, prueba cambiar a calidad Baja.",
  "konamiDoom.quality.low": "Baja",
  "konamiDoom.quality.medium": "Media",
  "konamiDoom.quality.high": "Alta",
  "konamiDoom.close": "Cerrar juego",
  "yuu.question": "¿Eres tú Yuu?",
  "yuu.yes": "SÍ",
  "yuu.no": "NO",
  "yuu.message": "Felicidades, encontraste lo que intenté esconder (o no tanto)."
}
