{
  "nav.home": "Home",
  "nav.blog": "Blog",
  "nav.about": "Chi sono",
  "nav.projects": "Progetti",
  "nav.login": "Accedi",
  "nav.experience": "Esperienza",
  "about.title": "Chi sono",
  "about.description": "Scopri di più su di me e il mio percorso",
  "about.imageAlt": "Foto di me con un libro rosso",
  "about.paragraph1": "Costruisco sistemi guidati da precisione e principi. Il codice è un mezzo per raggiungere la chiarezza, dove logica, rigore e convinzione convergono.",
  "about.paragraph2": "Come ingegnere autodidatta, ho passato anni ad affrontare problemi complessi in diverse discipline. Ho contribuito a progetti open-source di grande impatto, sviluppato smart contract con garanzie matematiche e progettato sistemi decentralizzati partendo dai primi principi. La programmazione funzionale, la verifica formale e l'architettura blockchain non sono astrazioni. Sono il modo in cui traduco l'intenzione in esecuzione.",
  "about.paragraph3": "Il mio approccio è fondato sull'epistemologia presupposizionale, sulla prasseologia austriaca e sulla teologia riformata. Non si tratta di filosofia fine a se stessa. Questi fondamenti affinano il mio ragionamento e plasmano direttamente il mio lavoro. La chiarezza in un ambito rafforza la precisione in un altro. Uno smart contract ben costruito e un sistema teologico coerente richiedono la stessa onestà intellettuale: nessun presupposto mutuato, nessuna contraddizione nascosta.",
  "about.paragraph4": "Ogni scelta progettuale riflette una filosofia. Dare priorità alla decentralizzazione significa preservare la sovranità. Usare sistemi di tipi forti significa eliminare l'ambiguità. Perseguire la verifica formale significa rifiutare l'idea che \"approssimativamente corretto\" basti quando la sicurezza conta. Non sono vincoli—sono un ritorno alla chiarezza.",
  "about.paragraph5": "Sono mosso da un'unica convinzione: costruire sistemi che durino. Sistemi che rispondano a principi, non a strutture di incentivi o coercizione. Sistemi che i miei figli possano ereditare senza bisogno di giustificazioni. Questo significa scegliere la profondità anziché la convenienza, il segnale anziché il rumore e avere strumenti propri anziché dipendere dalle aziende.",
  "about.paragraph6": "Il mio lavoro spazia dall'infrastruttura DeFi alla programmazione funzionale e allo sviluppo open-source. Scrivo di blockchain, filosofia, economia e teologia, esplorando come la tecnologia possa servire anziché limitare.",
  "blog.title": "Blog",
  "blog.description": "Post su sviluppo, prove formali e altri argomenti interessanti",
  "blog.readMore": "Leggi di più",
  "blog.backToBlog": "Torna al Blog",
  "blog.postsTitle": "Post del Blog",
  "blog.noPosts": "Nessun post trovato.",
  "blog.notFound": "Post non trovato",
  "blog.notFoundDescription": "Il post del blog richiesto non è stato trovato.",
  "projects.title": "Progetti",
  "projects.description": "Alcuni dei miei progetti personali e contributi",
  "projects.phi.title": "Phi - Un Interprete di Lambda Calcolo Puro",
  "projects.phi.description": "Phi è un interprete sofisticato per il lambda calcolo puro, implementato in Haskell. Fornisce un ambiente elegante e potente per esplorare espressioni di lambda calcolo, rendendolo ideale per scopi educativi e ricerca in informatica teorica.",
  "projects.treeson.title": "Treeson",
  "projects.treeson.description": "Treeson è uno strumento da riga di comando che converte strutture di directory e repository GitHub in formato JSON. Perfetto per documentazione, analisi e strumenti.",
  "projects.flowcash.title": "FlowCash",
  "projects.flowcash.description": "Un'app moderna ed elegante per la gestione delle finanze personali costruita con React Native ed Expo. Progettata con una UI premium ispirata al glassmorphism e architettura completamente offline, consente agli utenti di tracciare, analizzare e gestire le proprie finanze quotidiane in modo sicuro e intuitivo.",
  "projects.kind.title": "Fondamenti del Software in Kind (pt-BR)",
  "projects.kind.description": "Una traduzione del libro \"Software Foundations in Idris\" in portoghese, utilizzando il linguaggio di programmazione Kind. Questo progetto è stato sviluppato in collaborazione con Savio per la Higher Order Company.",
  "projects.agdavim.title": "Agda-vim",
  "projects.agdavim.description": "Un plugin Vim completo che aggiunge il supporto completo per l'evidenziazione della sintassi per i file Agda, inclusi parole chiave, tipi, operatori, simboli Unicode e pratiche scorciatoie da tastiera per la notazione matematica (λ, →, ∀, ≡).",
  "projects.agoriz.title": "Agoriz",
  "projects.agoriz.description": "Agoriz è un progetto volto a portare i pagamenti Web3 alle imprese. È progettato per semplificare, scalare e proteggere le transazioni basate su blockchain, consentendo alle aziende di integrare asset digitali e finanza programmabile nelle loro operazioni quotidiane.",
  "experience.title": "Esperienza",
  "experience.description": "Il mio percorso professionale nello sviluppo software, blockchain e sistemi decentralizzati",
  "experience.skills.title": "Competenze",
  "experience.skills.description": "Stack tecnico e domini di competenza sviluppati nel corso della carriera",
  "experience.education.title": "Formazione",
  "experience.education.description": "Percorso di apprendimento e sviluppo professionale",
  "experience.education.autodidact": "Ingegnere Software Autodidatta",
  "experience.education.subtitle": "Apprendimento Continuo e Comunità Tecniche",
  "experience.education.details": "Nessuna laurea accademica formale, ma apprendimento rigoroso attraverso articoli, progetti pratici e contributi open-source. Filosofia, logica e teologia riformata fondano decisioni tecniche e strategie di design.",
  "footer.rights": "Tutti i diritti riservati",
  "footer.madeWith": "Realizzato con",
  "common.loading": "Caricamento...",
  "common.error": "Errore di caricamento",
  "common.notFound": "Non trovato",
  "theme.light": "Tema Chiaro",
  "theme.dark": "Tema Scuro",
  "theme.toggle": "Cambia tema",
  "experience.agoriz.title": "Fondatore e Sviluppatore",
  "experience.agoriz.period": "Giu 2025 - Presente",
  "experience.agoriz.location": "Remoto",
  "experience.agoriz.description": "Creato e guidato Agoriz, un protocollo di pagamento decentralizzato—\"Stripe per blockchain\". Sviluppo e ottimizzazione di smart contract con sicurezza rigorosa, architettura multi-chain e zero-custody. Responsabile della progettazione, test, deployment e pianificazione delle funzionalità, garantendo scalabilità e privacy totale.",
  "experience.hoc.title": "Sviluppatore Software",
  "experience.hoc.period": "Mar 2023 - Feb 2025",
  "experience.hoc.location": "San Paolo, Brasile (Ibrido)",
  "experience.hoc.description": "Due anni sviluppando soluzioni web scalabili focalizzate sulla qualità e performance. Contribuito a importanti progetti open-source (Bend 19k⭐, Kind 3.7k⭐). Costruito interfacce responsive, API robuste e sistemi di autenticazione sicuri, applicando sempre best practice e test automatizzati.",
  "experience.uwu.title": "Sviluppatore di Videogiochi",
  "experience.uwu.period": "Ott 2023 - Set 2024",
  "experience.uwu.location": "Remoto (Part-time)",
  "experience.uwu.description": "Sviluppato meccaniche di gioco complesse, sistemi di IA, simulazioni fisiche ed esperienze immersive. Creato shader e effetti visivi, ottimizzati per multiple piattaforme. Collaborato con artisti e designer per integrazione di asset e qualità visiva.",
  "experience.kindelia.title": "Apprendista Programmazione Funzionale",
  "experience.kindelia.period": "Apr 2022 - Apr 2023",
  "experience.kindelia.location": "Remoto",
  "experience.kindelia.description": "Studio e applicazione della programmazione funzionale con Haskell, Agda, Kind e HVM. Ricerca su Web3 e smart contract, applicando metodi formali per garantire la correttezza del software e precise astrazioni matematiche.",
  "skills.functional.label": "Linguaggi Funzionali e Formali",
  "skills.blockchain.label": "Blockchain & Web3",
  "skills.web.label": "Web & Mobile",
  "skills.game.label": "Sviluppo di Videogiochi",
  "skills.tools.label": "Strumenti e Pratiche",
  "skills.domains.label": "Domini",
  "konamiDoom.title": "DOOM (1993)",
  "konamiDoom.loading": "Caricamento di DOOM...",
  "konamiDoom.activated": "Codice Konami Attivato!",
  "konamiDoom.preparing": "Preparazione all'esecuzione di DOOM...",
  "konamiDoom.controls": "Controlli: Clicca sul gioco e usa le frecce per muoverti, Ctrl per sparare, Alt per strafing, Spazio per usare.",
  "konamiDoom.performanceTip": "Suggerimento per le prestazioni: Se il gioco è lento, prova a passare alla qualità Bassa.",
  "konamiDoom.quality.low": "Bassa",
  "konamiDoom.quality.medium": "Media",
  "konamiDoom.quality.high": "Alta",
  "konamiDoom.close": "Chiudi gioco",
  "yuu.question": "Sei tu Yuu?",
  "yuu.yes": "SÌ",
  "yuu.no": "NO",
  "yuu.message": "Congratulazioni, hai trovato quello che ho cercato di nascondere (o non così tanto)."
}
