{
  "nav.home": "Início",
  "nav.blog": "Blog",
  "nav.about": "Sobre",
  "nav.projects": "Projetos",
  "nav.login": "Login",
  "nav.experience": "Experiência",
  "about.title": "Sobre",
  "about.description": "Conheça mais sobre mim e minha trajetória",
  "about.imageAlt": "Foto minha com um livro vermelho",
  "about.paragraph1": "Construo sistemas guiados por precisão e princípio. O código é um meio para alcançar clareza, onde lógica, rigor e convicção se encontram.",
  "about.paragraph2": "Como engenheiro autodidata, passei anos enfrentando problemas complexos em diferentes áreas. Contribuí para projetos open-source de alto impacto, desenvolvi smart contracts com garantias matemáticas e projetei sistemas descentralizados a partir de primeiros princípios. Programação funcional, verificação formal e arquitetura blockchain não são abstrações. São a forma como traduzo intenção em execução.",
  "about.paragraph3": "Minha abordagem se baseia em epistemologia pressuposicional, praxeologia austríaca e teologia reformada. Isso não é filosofia pela filosofia. Esses fundamentos afinam meu raciocínio e moldam diretamente meu trabalho. Clareza em uma área fortalece precisão em outra. Um smart contract bem construído e um sistema teológico coerente exigem a mesma honestidade intelectual: nenhuma suposição emprestada, nenhuma contradição escondida.",
  "about.paragraph4": "Cada decisão de design reflete uma filosofia. Priorizar descentralização é preservar soberania. Usar sistemas de tipos fortes é eliminar ambiguidade. Buscar verificação formal é rejeitar a ideia de que \"quase certo\" basta quando segurança importa. Essas não são limitações, são um retorno à clareza.",
  "about.paragraph5": "Me move uma única convicção: construir sistemas que durem. Sistemas que respondam a princípios, não a estruturas de incentivo ou coerção. Sistemas que meus filhos possam herdar sem precisar de justificativa. Isso significa escolher profundidade em vez de conveniência, sinal em vez de ruído, e ter ferramentas próprias em vez de depender de corporações.",
  "about.paragraph6": "Meu trabalho envolve infraestrutura DeFi, programação funcional e desenvolvimento open-source. Escrevo sobre blockchain, filosofia, economia e teologia, explorando como a tecnologia pode servir em vez de restringir.",
  "blog.title": "Blog",
  "blog.description": "Posts sobre desenvolvimento, provas formais e outros temas interessantes",
  "blog.readMore": "Ler mais",
  "blog.backToBlog": "Voltar ao Blog",
  "blog.postsTitle": "Posts do Blog",
  "blog.noPosts": "Nenhum post encontrado.",
  "blog.notFound": "Post não encontrado",
  "blog.notFoundDescription": "O post que você procura não foi encontrado.",
  "projects.title": "Projetos",
  "projects.description": "Alguns dos meus projetos pessoais e contribuições",
  "projects.phi.title": "Phi: Interpretador de Cálculo Lambda Puro",
  "projects.phi.description": "Phi é um interpretador sofisticado para cálculo lambda puro, implementado em Haskell. Oferece um ambiente elegante e poderoso para explorar expressões de cálculo lambda, ideal para fins educacionais e pesquisa em ciência da computação teórica.",
  "projects.treeson.title": "Treeson",
  "projects.treeson.description": "Treeson é uma ferramenta de linha de comando que converte estruturas de diretório e repositórios do GitHub em formato JSON. Perfeita para documentação, análise e automação.",
  "projects.flowcash.title": "FlowCash",
  "projects.flowcash.description": "Um app moderno e elegante de gestão financeira pessoal, construído com React Native e Expo. Com interface premium inspirada em glassmorphism e funcionamento totalmente offline, permite rastrear, analisar e gerenciar suas finanças do dia a dia de forma segura e intuitiva.",
  "projects.kind.title": "Fundamentos de Software em Kind (pt-BR)",
  "projects.kind.description": "Tradução do livro \"Software Foundations in Idris\" para português, usando a linguagem Kind. Este projeto foi desenvolvido em colaboração com Savio para a Higher Order Company.",
  "projects.agdavim.title": "Agda-vim",
  "projects.agdavim.description": "Plugin completo para Vim que adiciona destaque de sintaxe para arquivos Agda, incluindo palavras-chave, tipos, operadores, símbolos Unicode e atalhos de teclado para notação matemática (λ, →, ∀, ≡).",
  "projects.agoriz.title": "Agoriz",
  "projects.agoriz.description": "Agoriz é um projeto focado em trazer pagamentos Web3 para empresas. Foi criado para simplificar, escalar e proteger transações baseadas em blockchain, permitindo que empresas integrem ativos digitais e finanças programáveis no seu dia a dia.",
  "experience.title": "Experiência",
  "experience.description": "Minha trajetória profissional em desenvolvimento de software, blockchain e sistemas descentralizados",
  "experience.skills.title": "Habilidades",
  "experience.skills.description": "Stack técnico e áreas de expertise desenvolvidas ao longo da carreira",
  "experience.education.title": "Formação",
  "experience.education.description": "Trajetória de aprendizado e desenvolvimento profissional",
  "experience.education.autodidact": "Autodidata em Engenharia de Software",
  "experience.education.subtitle": "Aprendizado Contínuo e Comunidades Técnicas",
  "experience.education.details": "Sem formação acadêmica formal, mas com aprendizado rigoroso através de papers, projetos práticos e contribuições open-source. Filosofia, lógica e teologia reformada servem de base para decisões técnicas e estratégias de design.",
  "footer.rights": "Todos os direitos reservados",
  "footer.madeWith": "Feito com",
  "common.loading": "Carregando...",
  "common.error": "Erro ao carregar",
  "common.notFound": "Não encontrado",
  "theme.light": "Tema Claro",
  "theme.dark": "Tema Escuro",
  "theme.toggle": "Alternar tema",
  "experience.agoriz.title": "Fundador & Desenvolvedor",
  "experience.agoriz.period": "Jun 2025 - Presente",
  "experience.agoriz.location": "Remoto",
  "experience.agoriz.description": "Criei e lidero o Agoriz, protocolo de pagamentos descentralizado \"Stripe para blockchain\". Desenvolvo e otimizo smart contracts com segurança rigorosa, arquitetura multi-chain e zero-custódia. Responsável por design, testes, deploy e planejamento de funcionalidades, garantindo escalabilidade e privacidade total.",
  "experience.hoc.title": "Desenvolvedor de Software",
  "experience.hoc.period": "Mar 2023 - Fev 2025",
  "experience.hoc.location": "São Paulo, Brasil (Híbrido)",
  "experience.hoc.description": "Dois anos desenvolvendo soluções web escaláveis com foco em qualidade e performance. Contribuí em projetos open-source de destaque (Bend 19k⭐, Kind 3.7k⭐). Criei interfaces responsivas, APIs robustas e sistemas de autenticação seguros, sempre aplicando boas práticas e testes automatizados.",
  "experience.uwu.title": "Desenvolvedor de Jogos",
  "experience.uwu.period": "Out 2023 - Set 2024",
  "experience.uwu.location": "Remoto (Meio período)",
  "experience.uwu.description": "Desenvolvi mecânicas de jogo complexas, sistemas de IA, simulações físicas e experiências imersivas. Criei shaders e efeitos visuais, otimizando para múltiplas plataformas. Colaborei com artistas e designers para integração de ativos e qualidade visual.",
  "experience.kindelia.title": "Aprendiz de Programação Funcional",
  "experience.kindelia.period": "Abr 2022 - Abr 2023",
  "experience.kindelia.location": "Remoto",
  "experience.kindelia.description": "Estudei e apliquei programação funcional com Haskell, Agda, Kind e HVM. Pesquisei Web3 e smart contracts, aplicando métodos formais para garantir correção de software e abstrações matemáticas precisas.",
  "skills.functional.label": "Linguagens Funcionais & Formais",
  "skills.blockchain.label": "Blockchain & Web3",
  "skills.web.label": "Web & Mobile",
  "skills.game.label": "Game Development",
  "skills.tools.label": "Ferramentas & Práticas",
  "skills.domains.label": "Domínios"
}