{
  "nav.home": "ホーム (Home)",
  "nav.blog": "The Training Arc",
  "nav.about": "My Backstory",
  "nav.projects": "Battle Achievements",
  "nav.login": "Forbidden Technique",
  "nav.experience": "Power Level Data",
  "about.title": "A Warrior's Tale",
  "about.description": "Witness the journey of one who transcended their limits (´°̥̥̥̥̥̥̥̥ω°̥̥̥̥̥̥̥̥`)",
  "about.imageAlt": "Ore-sama in a determined battle stance, eyes glowing with determination",
  "about.paragraph1": "I build systems with the precision of a swordmaster. Code is my STAND ability—sharp as a katana, deadly as a jutsu, forged through endless training and suffering. Every line of code is a technique I've perfected. YARE YARE DAZE... (´°̥̥̥̥̥̥̥̥ω°̥̥̥̥̥̥̥̥`)",
  "about.paragraph2": "Watashi wa self-taught warrior desu! 自分で学んだ戦士! Born from nothing, I climbed the ranks through sheer determination and sweat. No dojo, no senseis handing out power-ups—just raw grinding and willpower. Contributed to legendary open-source battles (Bend with 19k⭐ confirmed, Kind with 3.7k⭐), developed smart contracts with mathematical guarantees (no plot armor needed), and designed decentralized systems from the ground UP. Functional programming is my most powerful technique. Blockchain architecture? That's my ULTIMATE SECRET JUTSU! The power of compound knowledge flows through my veins (๑•́ ω •̀๑)",
  "about.paragraph3": "My foundation is grounded in presuppositional epistemology, Austrian praxeology, and reformed theology—these are my THREE FUNDAMENTAL FORCES, the pillars of my ideology. Like the Sharingan reveals hidden truths, my philosophy cuts through bullshit and exposes the core of reality. No half-measures, no shortcuts, no borrowed power. This is the path of a true ninja, a true warrior (´；ω；`). I walk alone, but my conviction is UNSHAKEABLE.",
  "about.paragraph4": "Every design decision reflects a battle-tested philosophy, yare yare. Decentralization = True Freedom, like the Will of D in One Piece. Strong type systems = Eliminating the weak links in your armor. Formal verification = Training until perfection, leaving NOTHING to chance. These aren't limitations—they're WEAPONS forged in the crucible of logic. A system without verification is like fighting blind. NOT ON MY WATCH (´▽`)",
  "about.paragraph5": "My conviction is absolute: building systems that ENDURE. Systems that answer to principles, not to corporate overlords or the tyranny of incentive structures. Systems my descendants can inherit with PRIDE. That means choosing the hard path over convenience, signal over noise, and SOVEREIGNTY over corporate chains. This is the ninja way. KAGE BUNSHIN NO JUTSU—I multiply my efforts across every domain (๑•́ ω •̀๑)",
  "about.paragraph6": "My battles span DeFi infrastructure (that blockchain war), functional programming (the most elite combat style ୧༼ಠ益ಠ༽୨), and open-source campaigns. I write about blockchain, philosophy, economics, and theology—exploring how technology can liberate humanity instead of enslaving us. I'm not just coding. I'm building a MOVEMENT. This is my lifetime quest (´°̥̥̥̥̥̥̥̥ω°̥̥̥̥̥̥̥̥`)",
  "blog.title": "ブログ - The Training Arc Diaries",
  "blog.description": "Chronicles of battles fought, techniques perfected, and enemies defeated through pure intellect",
  "blog.readMore": "続きを読む - Read the Full Battle Report",
  "blog.backToBlog": "ブログに戻る - Return to the Training Grounds (´▽`)",
  "blog.postsTitle": "ブログの投稿 - Archived Battle Stories",
  "blog.noPosts": "No battles recorded yet... Konnaniha... (´；ω；`)",
  "blog.notFound": "This chapter was sealed away... Nani?! ୧༼ಠ益ಠ༽୨",
  "blog.notFoundDescription": "The battle record you seek does not exist in this timeline. Perhaps you've taken a wrong turn. OMAE WA MOU SHINDEIRU (´；ω；`)",
  "projects.title": "プロジェクト - My Arsenal",
  "projects.description": "Legendary weapons and techniques forged through countless hours of training (´°̥̥̥̥̥̥̥̥ω°̥̥̥̥̥̥̥̥`)",
  "projects.phi.title": "Phi - The Lambda Calculus Blade ୧༼ಠ益ಠ༽୨",
  "projects.phi.description": "Phi-no-Katana is a sophisticated interpreter for pure lambda calculus, implemented in Haskell (the language of the enlightened). A weapon of pure elegance and power, forged through mathematical precision. In the right hands, it becomes a LEGENDARY TOOL for exploring the deepest truths of computation (´▽`)",
  "projects.treeson.title": "Treeson - The JSON Alchemist",
  "projects.treeson.description": "Treeson is a command-line warrior that transmutes directory structures and GitHub repositories into JSON format. A support skill, but when combined with other techniques, becomes DEVASTATINGLY EFFECTIVE. Perfect for analysis and strategic planning (๑•́ ω •̀๑)",
  "projects.flowcash.title": "FlowCash - Your Monetary Breakthrough ୧༼ಠ益ಠ༽୨",
  "projects.flowcash.description": "A modern and elegant personal finance application built with React Native and Expo. Designed with glassmorphism aesthetics and COMPLETELY OFFLINE—your financial data remains pure, untainted, and FREE from corporate surveillance. Users can track and dominate their finances like true warriors (´°̥̥̥̥̥̥̥̥ω°̥̥̥̥̥̥̥̥`)",
  "projects.kind.title": "Software Foundations in Kind (pt-BR) - Knowledge Inheritance",
  "projects.kind.description": "A translation of Software Foundations from Idris to Portuguese using the Kind programming language. Developed alongside Savio and the legendary Higher Order Company. This project passes the torch of knowledge to the next generation—THAT IS THE TRUE NINJA WAY (´▽`)",
  "projects.agdavim.title": "Agda-vim - The Code Editor's Secret Technique",
  "projects.agdavim.description": "A comprehensive Vim plugin that grants full syntax highlighting powers to Agda files. Keywords, types, operators, Unicode symbols (λ, →, ∀, ≡)—all the mathematical notation a true warrior needs. When mastered, Vim becomes your FIGHTING SPIRIT MADE MANIFEST (´°̥̥̥̥̥̥̥̥ω°̥̥̥̥̥̥̥̥`)",
  "projects.agoriz.title": "Agoriz - Web3 Payments Revolutionized ୧༼ಠ益ಠ༽୨",
  "projects.agoriz.description": "Agoriz is the decentralized payment protocol that brings Web3 to enterprises. Centralized systems are the ENEMY—old guard that must be overthrown. This protocol simplifies, scales, and secures blockchain transactions with ZERO COMPROMISE. Businesses can now integrate digital assets and programmable finance into their operations. This is the future, whether they accept it or not (´▽`)",
  "experience.title": "経験値 - My Power Level",
  "experience.description": "The chronicles of my battles in software development, blockchain warfare, and decentralized system mastery",
  "experience.skills.title": "スキル - Unlocked Techniques",
  "experience.skills.description": "An arsenal of technical expertise developed through years of grinding and pushing past limits",
  "experience.education.title": "教育 - The Path of Self-Discovery",
  "experience.education.description": "A non-traditional journey of knowledge acquisition and personal growth",
  "experience.education.autodidact": "Self-Taught Software Engineer - 独学の戦士",
  "experience.education.subtitle": "Continuous Grinding & Technical Enlightenment (´°̥̥̥̥̥̥̥̥ω°̥̥̥̥̥̥̥̥`)",
  "experience.education.details": "No formal academic credentials, only the hardest path: self-education through papers, practical battles, and open-source warfare. Philosophy, logic, and reformed theology serve as my ideological foundation—the core beliefs that guide every technical decision. Learned everything through PURE DETERMINATION and the fire of passion. Like a true protagonist, I wrote my own story (๑•́ ω •̀๑)",
  "footer.rights": "All rights reserved - Protect this knowledge with your life",
  "footer.madeWith": "Made with",
  "common.loading": "Loading... The battle is beginning (´；ω；`)",
  "common.error": "Error encountered... The enemy is too strong! ୧༼ಠ益ಠ༽୨",
  "common.notFound": "Not found... Have we been defeated? (´；ω；`)",
  "theme.light": "Light Theme - Daytime Training Mode (´▽`)",
  "theme.dark": "Dark Theme - Nighttime Battle Mode (´°̥̥̥̥̥̥̥̥ω°̥̥̥̥̥̥̥̥`)",
  "theme.toggle": "Switch Modes - Kamae wo Kaeru (˶ᵔ ᵕ ᵔ˶)",
  "experience.agoriz.title": "Founder & Developer - The Captain (´▽`)",
  "experience.agoriz.period": "Jun 2025 - Present (The Quest Continues)",
  "experience.agoriz.location": "Remote (Wherever Justice Demands)",
  "experience.agoriz.description": "Founded and lead Agoriz, a decentralized payment protocol—the \"Stripe for blockchain\" that the industry NEEDS. Continuously optimize smart contracts with IRONCLAD security (zero rug pull tolerance), multi-chain architecture, and absolute zero-custody protocols. Responsible for every aspect: design, testing, deployment, and strategic planning. Scalability and privacy are maximized to their theoretical limits—this is not compromise, this is PERFECTION (๑•́ ω •̀๑)",
  "experience.hoc.title": "Software Developer - Code Warrior (´°̥̥̥̥̥̥̥̥ω°̥̥̥̥̥̥̥̥`)",
  "experience.hoc.period": "Mar 2023 - Feb 2025 (Two Years in the Arena)",
  "experience.hoc.location": "São Paulo, Brazil (Hybrid Battlefield) ୧༼ಠ益ಠ༽୨",
  "experience.hoc.description": "Two years of continuous development, building scalable web solutions with UNWAVERING focus on quality and performance. Contributed to legendary open-source projects that shaped the industry (Bend 19k⭐, Kind 3.7k⭐)—these are where the REAL warriors gather. Built responsive interfaces that break through limitations, robust APIs that never falter, and authentication systems forged in steel. Every deployment was tested, every line reviewed, every optimization pursued. This is the ninja way (´▽`)",
  "experience.uwu.title": "Game Developer - Interactive Combat Designer",
  "experience.uwu.period": "Oct 2023 - Sep 2024 (The Side Quest Arc)",
  "experience.uwu.location": "Remote (The Creative Realm) (˶ᵔ ᵕ ᵔ˶)",
  "experience.uwu.description": "Developed complex game mechanics that pushed players to their limits, AI systems with DEVASTATING intelligence, and physics simulations that felt ALIVE. Crafted shaders and visual effects that transcended ordinary graphics—optimization across multiple platforms was non-negotiable. Collaborated with artists and designers to bring visions to life, ensuring every visual element served the greater purpose of immersion and impact (´°̥̥̥̥̥̥̥̥ω°̥̥̥̥̥̥̥̥`)",
  "experience.kindelia.title": "Functional Programming Apprentice - The Seito Arc",
  "experience.kindelia.period": "Apr 2022 - Apr 2023 (Year of Enlightenment)",
  "experience.kindelia.location": "Remote (The Functional Dojo)",
  "experience.kindelia.description": "Studied and mastered functional programming across Haskell, Agda, Kind, and HVM—THE LANGUAGES OF THE GODS themselves. Deep research into Web3 and smart contract warfare, applying formal methods to guarantee correctness. Mathematical abstractions weren't theoretical exercises; they were WEAPONS of precision, each proof a victory against uncertainty and error. This is where true programming transcends into art (๑•́ ω •̀๑)",
  "skills.functional.label": "Functional & Formal Languages - The ULTIMATE Paradigm ୧༼ಠ益ಠ༽୨",
  "skills.blockchain.label": "Blockchain & Web3 - The Revolution Itself",
  "skills.web.label": "Web & Mobile - Frontend Mastery (´°̥̥̥̥̥̥̥̥ω°̥̥̥̥̥̥̥̥`)",
  "skills.game.label": "Game Development - Interactive Storytelling (´▽`)",
  "skills.tools.label": "Tools & Practices - Armory Management",
  "skills.domains.label": "Domains - Where Legends Are Forged ୧༼ಠ益ಠ༽୨"
}
